rand_list = [28, 69, 72, -95, -72, 27, -56, -32, -54, -66, -99, 27, 73, -7, -83, -4, -21, -57, 69, -20, 20, 59, -77, -20, -57, 49, -37, -58, -57, 11, 72, -12, 32, 92, 51, -29, 79, 15, -75, -96, -56, -39, -20, 9, 65, -58, -81, -97, -67, -80]

min_elem = 0

for number in rand_list:  # перебираю каждый элемент списка
    if number < min_elem:  # если текущий элемент меньше самого маленького
        min_elem = number  # самый маленький элемент - текущий

print(f'Наименьшее: {min_elem}.')  # вывожу наименьшее
